04_Simulation/1.FROZEN/PH_2D_RANS_kOmegaSSTx_GEP_pimpleURANS_Mesh_270_by_290_Chitrarth_Lav/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
78300
(
(0.023973641 0.00010016136 -3.5714995e-18)
(0.016053855 -3.6681293e-05 9.7970737e-18)
(0.016364628 -8.1683392e-05 7.1981665e-18)
(0.026404308 -0.00073381448 2.6968924e-17)
(0.018695907 -0.0014061518 3.6866802e-17)
(0.012334606 -0.0016667554 -4.8797793e-18)
(0.012087106 -0.0017401279 -2.7821769e-18)
(0.001990619 -0.00041660982 5.6752788e-18)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hills
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
