04_Simulation/1.FROZEN/PH_2D_RANS_kOmegaSSTx_GEP_pimpleURANS_Mesh_270_by_290_Chitrarth_Lav/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
78300
(
54192.154
63741.753
62722.606
55515.751
57681.333
65748.004
63175.265
57850.104
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
270
(
89217.478
89229.5
89229.5
89172.613
88950.903
88474.872
88474.872
87671.363
...
)
;
    }
    hills
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
270
(
89220.368
89230.456
89230.456
89259.318
89570.704
90688.172
90688.172
93335.912
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
